tests/Mock/CheckoutFetchTransactionDon.txt

HTTP/1.1 200 OK
Server: Apache
Date: Sun, 11 May 2014 21:17:31 GMT
Content-Type: application/json; charset=utf-8
Status: 200 OK

{"status":{"error_code":"","status":"SUCCESS","message":"","response_code":"","operation_id":"b2a6e6db-7d83-4edc-8a14-a1a2fff7d95f"},"data":{"id":"checkout_ac18419fb53bceca963a43560ab3f591","status":"DON","language":"en","org_id":"87d0faad-3b61-4878-b3fa-79a9a32c5e14","merchant_color":"323fff","merchant_logo":"https://sboxiconslib.rapyd.net/merchant-logos/ohpc_525fa9f9549110ab05f2a0d011583b95.png","merchant_website":"https://www.rapyd.net","merchant_customer_support":{},"merchant_alias":"N/A","merchant_terms":null,"merchant_privacy_policy":null,"page_expiration":1706329963,"redirect_url":"https://sandboxcheckout.rapyd.net/?token=checkout_ac18419fb53bceca963a43560ab3f591","region":"AMERICAS","geo_country":"US","merchant_main_button":"pay_now","cancel_checkout_url":"https://example.com/cancel","complete_checkout_url":"https://example.com/complete","country":"US","currency":"USD","amount":100,"payment":{"id":"payment_91b87ed2d4cec7098616d172af171dc8","amount":100,"original_amount":100,"is_partial":false,"currency_code":"USD","country_code":"US","status":"CLO","description":"Payment via Checkout","merchant_reference_id":"0912-2021","customer_token":null,"payment_method":"card_1cb8bb8e38555fa46afa4f23142b7f4e","payment_method_data":{"name":"111","last4":"1111","brand":"VISA"},"expiration":1706329963,"captured":true,"refunded":false,"refunded_amount":0,"receipt_email":null,"redirect_url":null,"complete_payment_url":"https://sandboxcheckout.rapyd.net/thank-you-success/checkout_ac18419fb53bceca963a43560ab3f591","error_payment_url":"https://sandboxcheckout.rapyd.net/thank-you-failed/checkout_ac18419fb53bceca963a43560ab3f591","receipt_number":null,"flow_type":null,"address":null,"statement_descriptor":"N/A","transaction_id":null,"created_at":1705725163,"updated_at":1705725164,"metadata":{},"failure_code":null,"failure_message":null,"paid":true,"paid_at":1705725163,"dispute":null,"refunds":null,"order":null,"outcome":null,"visual_codes":{},"textual_codes":{},"instructions":[],"ewallets":[{"ewallet":"ewallet_598b52161c9caf83794e6e97ddc54cb5","amount":100,"percent":100}],"payment_method_options":{},"payment_method_type":"us_debit_visa_card","payment_method_type_category":"card","fx_rate":1,"merchant_requested_currency":null,"merchant_requested_amount":null,"fixed_side":null,"payment_fees":null,"invoice":null,"escrow":null,"group_payment":null,"cancel_reason":null,"initiation_type":"customer_present","mid":null,"next_action":"not_applicable"},"payment_method_type":null,"payment_method_type_categories":null,"payment_method_types_include":null,"payment_method_types_exclude":null,"account_funding_transaction":null,"customer":null,"custom_elements":{"save_card_default":false,"display_description":false,"payment_fees_display":true,"merchant_currency_only":false,"billing_address_collect":false,"dynamic_currency_conversion":false},"timestamp":1705723764,"payment_expiration":null,"cart_items":[],"escrow":null,"escrow_release_days":null,"payment_method_types":[{"category":"card","order":0,"types":[{"type":"us_debit_visa_card","mapping":[{"brand":"visa","card_types":["debit","debit"]}],"order":0,"image":"https://iconslib.rapyd.net/checkout/us_debit_visa_card.png","instructions":[],"name":"Visa Debit","fields":[{"name":"number","type":"string","regex":null,"description":"card number","is_required":true},{"name":"expiration_month","type":"string","regex":"^.{1,200}","is_required":true,"instructions":"expiration month as string, 01-12"},{"name":"expiration_year","type":"string","regex":null,"is_required":true,"instructions":"expiration year in to digits as string, 18-99"},{"name":"name","type":"string","regex":null,"is_required":false,"instructions":"card holder name"},{"name":"cvv","type":"string","regex":null,"is_required":true,"instructions":"card cvv"},{"name":"number_type","type":"string","regex":"(fpan|tpan)","description":"Determining if number is funding PAN or token PAN","is_required":false}],"supported_currencies":["USD"],"payment_method_options":[{"name":"3d_required","type":"string","regex":null,"description":"Allows the client to determine whether the customer is required to complete 3DS authentication for the transaction","is_required":false,"is_updatable":false},{"name":"tavv","type":"String","regex":null,"description":"Token Authentication Verification Value represented as a 20-byte value that is base64 encoded.","is_required":false,"is_updatable":false}],"payment_options":[{"name":"customer","type":"customer","regex":null,"description":"Make sure a customer was created with first_name, last_name and address with Country(ISO 3166),state(US Postal Service 2-letter code),city, line1, zipcode","is_required":true,"is_updatable":false,"required_fields":[{"name":"name","type":"string","regex":null,"description":"Customer`s full name","is_required":true,"is_updatable":false},{"name":"addresses","type":"address","regex":null,"description":"customer address","is_required":true,"is_updatable":false,"required_fields":[{"name":"line_1","type":"string","regex":"^.{1,200}","description":"Customer`s address","is_required":true,"is_updatable":false},{"name":"city","type":"string","regex":"^.{1,40}","description":"Customer`s city","is_required":false,"is_updatable":false},{"name":"country","type":"string","regex":"US","description":"Customer`s country","is_required":false,"is_updatable":false},{"name":"zip","type":"number","regex":null,"description":"Customer`s postal code ","is_required":true,"is_updatable":false},{"name":"state","type":"string","regex":"|Alabama|Alaska|Arizona|Arkansas|California|Colorado|Connecticut|Delaware|District of Columbia|Florida|Georgia|Hawaii|Idaho|Illinois|Indiana|Iowa|Kansas|Kentucky|Louisiana|Maine|Maryland|Massachusetts|Michigan|Minnesota|Mississippi|Missouri|Montana|Nebraska|Nevada|New Hampshire|New Jersey|New Mexico|New York|North Carolina|North Dakota|Ohio|Oklahoma|Oregon|Pennsylvania|Rhode Island|South Carolina|South Dakota|Tennessee|Texas|Utah|Vermont|Virginia|Washington|West Virginia|Wisconsin|Wyomin|American Samoa|Guam|Northern Mariana Islands|Puerto Rico|United States Minor Outlying Islands|Virgin Islands","description":"Customer`s state","is_required":false,"is_updatable":false},{"name":"name","type":"string","regex":"^.{1,200}","description":"address name","is_required":true,"is_updatable":false}]}]},{"name":"address","type":"address","regex":null,"description":"billing address requierd when is billing address is different than main address","is_required":false,"is_updatable":false,"required_fields":[{"name":"line_1","type":"string","regex":"^.{1,200}","description":"Customer`s address","is_required":false,"is_updatable":false},{"name":"city","type":"string","regex":"^.{1,40}","description":"Customer`s city","is_required":false,"is_updatable":false},{"name":"country","type":"string","regex":"US","description":"Customer`s country in ISO 3166 format","is_required":false,"is_updatable":false},{"name":"zip","type":"number","regex":null,"description":null,"is_required":false,"is_updatable":false},{"name":"state","type":"string","regex":"|Alabama|Alaska|Arizona|Arkansas|California|Colorado|Connecticut|Delaware|District of Columbia|Florida|Georgia|Hawaii|Idaho|Illinois|Indiana|Iowa|Kansas|Kentucky|Louisiana|Maine|Maryland|Massachusetts|Michigan|Minnesota|Mississippi|Missouri|Montana|Nebraska|Nevada|New Hampshire|New Jersey|New Mexico|New York|North Carolina|North Dakota|Ohio|Oklahoma|Oregon|Pennsylvania|Rhode Island|South Carolina|South Dakota|Tennessee|Texas|Utah|Vermont|Virginia|Washington|West Virginia|Wisconsin|Wyomin|American Samoa|Guam|Northern Mariana Islands|Puerto Rico|United States Minor Outlying Islands|Virgin Islands","description":"Customer`s state","is_required":false,"is_updatable":false},{"name":"name","type":"string","regex":"^.{1,200}","description":"address name","is_required":false,"is_updatable":false}]}],"supported_digital_wallet_providers":[],"min_amount":null,"max_amount":null,"authorization_flow":false,"is_conditional":false,"supports_subscription":true,"is_mobile_money":false,"is_redirect":false},{"type":"us_debit_mastercard_card","mapping":[{"brand":"mastercard","card_types":["debit","debit"]}],"order":1,"image":"https://iconslib.rapyd.net/checkout/us_debit_mastercard_card.png","instructions":[],"name":"Mastercard Debit","fields":[{"name":"number","type":"string","regex":null,"is_required":true,"instructions":"card number"},{"name":"expiration_month","type":"string","regex":null,"is_required":true,"instructions":"expiration month as string, 01-12"},{"name":"expiration_year","type":"string","regex":null,"is_required":true,"instructions":"expiration year in to digits as string, 18-99"},{"name":"name","type":"string","regex":null,"is_required":false,"instructions":"card holder name"},{"name":"cvv","type":"string","regex":null,"is_required":true,"instructions":"card cvv"},{"name":"number_type","type":"string","regex":"(fpan|tpan)","description":"Determining if number is funding PAN or token PAN","is_required":false}],"supported_currencies":["USD"],"payment_method_options":[{"name":"3d_required","type":"string","regex":null,"description":"Allows the client to determine whether the customer is required to complete 3DS authentication for the transaction","is_required":false,"is_updatable":false},{"name":"tavv","type":"String","regex":null,"description":"Token Authentication Verification Value represented as a 20-byte value that is base64 encoded.","is_required":false,"is_updatable":false}],"payment_options":[{"name":"customer","type":"customer","regex":null,"description":"Make sure a customer was created with first_name, last_name and address with Country(ISO 3166),state(US Postal Service 2-letter code),city, line1, zipcode","is_required":true,"is_updatable":false,"required_fields":[{"name":"name","type":"string","regex":null,"description":"Customer`s full name","is_required":true,"is_updatable":false},{"name":"addresses","type":"address","regex":null,"description":"customer address","is_required":true,"is_updatable":false,"required_fields":[{"name":"line_1","type":"string","regex":"^.{1,200}","description":"Customer`s address","is_required":true,"is_updatable":false},{"name":"city","type":"string","regex":"^.{1,40}","description":"Customer`s city","is_required":false,"is_updatable":false},{"name":"country","type":"string","regex":"US","description":"Customer`s country","is_required":false,"is_updatable":false},{"name":"zip","type":"number","regex":null,"description":"Customer`s postal code ","is_required":true,"is_updatable":false},{"name":"state","type":"string","regex":"|Alabama|Alaska|Arizona|Arkansas|California|Colorado|Connecticut|Delaware|District of Columbia|Florida|Georgia|Hawaii|Idaho|Illinois|Indiana|Iowa|Kansas|Kentucky|Louisiana|Maine|Maryland|Massachusetts|Michigan|Minnesota|Mississippi|Missouri|Montana|Nebraska|Nevada|New Hampshire|New Jersey|New Mexico|New York|North Carolina|North Dakota|Ohio|Oklahoma|Oregon|Pennsylvania|Rhode Island|South Carolina|South Dakota|Tennessee|Texas|Utah|Vermont|Virginia|Washington|West Virginia|Wisconsin|Wyomin|American Samoa|Guam|Northern Mariana Islands|Puerto Rico|United States Minor Outlying Islands|Virgin Islands","description":"Customer`s state","is_required":false,"is_updatable":false},{"name":"name","type":"string","regex":"^.{1,200}","description":"address name","is_required":true,"is_updatable":false}]}]},{"name":"address","type":"address","regex":null,"description":"billing address requierd when is billing address is different than main address","is_required":false,"is_updatable":false,"required_fields":[{"name":"line_1","type":"string","regex":"^.{1,200}","description":"Customer`s address","is_required":false,"is_updatable":false},{"name":"city","type":"string","regex":"^.{1,40}","description":"Customer`s city","is_required":false,"is_updatable":false},{"name":"country","type":"string","regex":"US","description":"Customer`s country in ISO 3166 format","is_required":false,"is_updatable":false},{"name":"zip","type":"number","regex":null,"description":null,"is_required":false,"is_updatable":false},{"name":"state","type":"string","regex":"|Alabama|Alaska|Arizona|Arkansas|California|Colorado|Connecticut|Delaware|District of Columbia|Florida|Georgia|Hawaii|Idaho|Illinois|Indiana|Iowa|Kansas|Kentucky|Louisiana|Maine|Maryland|Massachusetts|Michigan|Minnesota|Mississippi|Missouri|Montana|Nebraska|Nevada|New Hampshire|New Jersey|New Mexico|New York|North Carolina|North Dakota|Ohio|Oklahoma|Oregon|Pennsylvania|Rhode Island|South Carolina|South Dakota|Tennessee|Texas|Utah|Vermont|Virginia|Washington|West Virginia|Wisconsin|Wyomin|American Samoa|Guam|Northern Mariana Islands|Puerto Rico|United States Minor Outlying Islands|Virgin Islands","description":"Customer`s state","is_required":false,"is_updatable":false},{"name":"name","type":"string","regex":"^.{1,200}","description":"address name","is_required":false,"is_updatable":false}]}],"supported_digital_wallet_providers":[],"min_amount":null,"max_amount":null,"authorization_flow":false,"is_conditional":false,"supports_subscription":true,"is_mobile_money":false,"is_redirect":false},{"type":"us_atmdebit_card","mapping":null,"order":2,"image":"https://iconslib.rapyd.net/checkout/us_atmdebit_card.png","instructions":[],"name":"Other","fields":[{"name":"number","type":"string","regex":null,"is_required":true,"instructions":"card number"},{"name":"expiration_month","type":"string","regex":null,"is_required":true,"instructions":"expiration month as string, 01-12"},{"name":"expiration_year","type":"string","regex":null,"is_required":true,"instructions":"expiration year in to digits as string, 18-99"},{"name":"name","type":"string","regex":null,"is_required":false,"instructions":"card holder name"},{"name":"cvv","type":"string","regex":null,"is_required":true,"instructions":"card cvv"},{"name":"number_type","type":"string","regex":"(fpan|tpan)","description":"Determining if number is funding PAN or token PAN","is_required":false}],"supported_currencies":["USD"],"payment_method_options":[{"name":"3d_required","type":"string","regex":null,"description":"Allows the client to determine whether the customer is required to complete 3DS authentication for the transaction","is_required":false,"is_updatable":false},{"name":"tavv","type":"String","regex":null,"description":"Token Authentication Verification Value represented as a 20-byte value that is base64 encoded.","is_required":false,"is_updatable":false}],"payment_options":[{"name":"customer","type":"customer","regex":null,"description":"Make sure a customer was created with first_name, last_name and address with Country(ISO 3166),state(US Postal Service 2-letter code),city, line1, zipcode","is_required":true,"is_updatable":false}],"supported_digital_wallet_providers":[],"min_amount":null,"max_amount":null,"authorization_flow":false,"is_conditional":false,"supports_subscription":true,"is_mobile_money":false,"is_redirect":false},{"type":"us_debit_discover_card","mapping":[{"brand":"discover","card_types":["debit","debit"]}],"order":3,"image":"https://iconslib.rapyd.net/checkout/us_debit_discover_card.png","instructions":[],"name":"Discover Debit","fields":[{"name":"number","type":"string","regex":null,"is_required":true,"instructions":"card number"},{"name":"expiration_month","type":"string","regex":null,"is_required":true,"instructions":"expiration month as string, 01-12"},{"name":"expiration_year","type":"string","regex":null,"is_required":true,"instructions":"expiration year in to digits as string, 18-99"},{"name":"name","type":"string","regex":null,"is_required":false,"instructions":"card holder name"},{"name":"cvv","type":"string","regex":null,"is_required":true,"instructions":"card cvv"},{"name":"number_type","type":"string","regex":"(fpan|tpan)","description":"Determining if number is funding PAN or token PAN","is_required":false}],"supported_currencies":["USD"],"payment_method_options":[{"name":"3d_required","type":"string","regex":null,"description":"Allows the client to determine whether the customer is required to complete 3DS authentication for the transaction","is_required":false,"is_updatable":false},{"name":"tavv","type":"String","regex":null,"description":"Token Authentication Verification Value represented as a 20-byte value that is base64 encoded.","is_required":false,"is_updatable":false}],"payment_options":[{"name":"customer","type":"customer","regex":null,"description":"Make sure a customer was created with first_name, last_name and address with Country(ISO 3166),state(US Postal Service 2-letter code),city, line1, zipcode","is_required":true,"is_updatable":false,"required_fields":[{"name":"name","type":"string","regex":null,"description":"Customer`s full name","is_required":true,"is_updatable":false},{"name":"addresses","type":"address","regex":null,"description":"customer address","is_required":true,"is_updatable":false,"required_fields":[{"name":"line_1","type":"string","regex":"^.{1,200}","description":"Customer`s address","is_required":true,"is_updatable":false},{"name":"city","type":"string","regex":"^.{1,40}","description":"Customer`s city","is_required":false,"is_updatable":false},{"name":"country","type":"string","regex":"US","description":"Customer`s country","is_required":false,"is_updatable":false},{"name":"zip","type":"number","regex":null,"description":"Customer`s postal code ","is_required":true,"is_updatable":false},{"name":"state","type":"string","regex":"|Alabama|Alaska|Arizona|Arkansas|California|Colorado|Connecticut|Delaware|District of Columbia|Florida|Georgia|Hawaii|Idaho|Illinois|Indiana|Iowa|Kansas|Kentucky|Louisiana|Maine|Maryland|Massachusetts|Michigan|Minnesota|Mississippi|Missouri|Montana|Nebraska|Nevada|New Hampshire|New Jersey|New Mexico|New York|North Carolina|North Dakota|Ohio|Oklahoma|Oregon|Pennsylvania|Rhode Island|South Carolina|South Dakota|Tennessee|Texas|Utah|Vermont|Virginia|Washington|West Virginia|Wisconsin|Wyomin|American Samoa|Guam|Northern Mariana Islands|Puerto Rico|United States Minor Outlying Islands|Virgin Islands","description":"Customer`s state","is_required":false,"is_updatable":false},{"name":"name","type":"string","regex":"^.{1,200}","description":"address name","is_required":true,"is_updatable":false}]}]},{"name":"address","type":"address","regex":null,"description":"billing address requierd when is billing address is different than main address","is_required":false,"is_updatable":false,"required_fields":[{"name":"line_1","type":"string","regex":"^.{1,200}","description":"Customer`s address","is_required":false,"is_updatable":false},{"name":"city","type":"string","regex":"^.{1,40}","description":"Customer`s city","is_required":false,"is_updatable":false},{"name":"country","type":"string","regex":"US","description":"Customer`s country in ISO 3166 format","is_required":false,"is_updatable":false},{"name":"zip","type":"number","regex":null,"description":null,"is_required":false,"is_updatable":false},{"name":"state","type":"string","regex":"|Alabama|Alaska|Arizona|Arkansas|California|Colorado|Connecticut|Delaware|District of Columbia|Florida|Georgia|Hawaii|Idaho|Illinois|Indiana|Iowa|Kansas|Kentucky|Louisiana|Maine|Maryland|Massachusetts|Michigan|Minnesota|Mississippi|Missouri|Montana|Nebraska|Nevada|New Hampshire|New Jersey|New Mexico|New York|North Carolina|North Dakota|Ohio|Oklahoma|Oregon|Pennsylvania|Rhode Island|South Carolina|South Dakota|Tennessee|Texas|Utah|Vermont|Virginia|Washington|West Virginia|Wisconsin|Wyomin|American Samoa|Guam|Northern Mariana Islands|Puerto Rico|United States Minor Outlying Islands|Virgin Islands","description":"Customer`s state","is_required":false,"is_updatable":false},{"name":"name","type":"string","regex":"^.{1,200}","description":"address name","is_required":false,"is_updatable":false}]}],"supported_digital_wallet_providers":[],"min_amount":null,"max_amount":null,"authorization_flow":false,"is_conditional":false,"supports_subscription":true,"is_mobile_money":false,"is_redirect":false}]}]}}


